First/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

First/src/Documents/УстановкаЦен/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЦеныНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Цены.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииНоменклатуры(ТекущиеДанные);
	
	
КонецПроцедуры 


&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)
	
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		ИзмененнаяСтрока.Цена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
	КонецЕсли;
			
 КонецПроцедуры 


&НаКлиенте
Процедура Подбор(Команда)     
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
		
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора",ПараметрыФормы, Элементы.Цены);
КонецПроцедуры



&НаКлиенте
Процедура ЦеныОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Номенклатура",ВыбранноеЗначение);
	
	СтрокиТаблицы = Объект.Цены.НайтиСтроки(ОтборСтрок);
	
	Если СтрокиТаблицы.Количество() > 0 Тогда 
		НоваяСтрока = Объект.Цены.Добавить(); 
		НоваяСтрока.Номенклатура = ВыбранноеЗначение;
		ПриИзмененииНоменклатуры(НоваяСтрока); 
	КонецЕсли;
	
	НоваяСтрока = Объект.Цены.Добавить();
	НоваяСтрока.Номенклатура = ВыбранноеЗначение;
	
КонецПроцедуры
